```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=si38]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-08-19 16:43:20.228633152 +0000 UTC]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-08-19 16:43:20.08616155 +0000 UTC]
module.dns.module.dns[1].aws_acm_certificate.apex_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/c9310a3b-73b9-4dbb-84df-e87027b2b056]
module.dns.module.dns[1].aws_route53_record.apex_wildcard["scaffold.ly"]: Refreshing state... [id=Z08393103BT7N9U33F6L7__7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly._CNAME]
module.dns.module.dns[0].aws_route53_record.apex_wildcard["scaffoldly.dev"]: Refreshing state... [id=Z09011832P733251NUAHX__5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev._CNAME]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs]
module.dns.module.dns[1].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/f9c38627-5deb-4a5e-b2a6-b303c33d32e9]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.dns.module.dns[0].aws_acm_certificate.apex_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/e4c418a0-8949-4636-8269-a78eb57b72d9]
module.dns.module.dns[0].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/3c2dfec3-f3c6-4573-b359-602f45d0ea3f]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=940977880]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.dns.module.dns[0].aws_route53_zone.zone: Refreshing state... [id=Z09011832P733251NUAHX]
module.dns.module.dns[1].aws_route53_zone.zone: Refreshing state... [id=Z08393103BT7N9U33F6L7]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws_logging.aws_cloudtrail.cloudtrail will be created
  + resource "aws_cloudtrail" "cloudtrail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "cloudtrail"
      + s3_bucket_name                = "scaffoldly-si38-logs-cloudtrail"

      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::S3::Object"
              + values = [
                  + "arn:aws:s3:::",
                ]
            }
        }
      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::Lambda::Function"
              + values = [
                  + "arn:aws:lambda",
                ]
            }
        }
    }

  # module.aws_logging.aws_s3_bucket.logs must be replaced
-/+ resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
        acl                         = "log-delivery-write"
      ~ arn                         = "arn:aws:s3:::scaffoldly-si38-logs" -> (known after apply)
      ~ bucket                      = "scaffoldly-si38-logs" -> "scaffoldly-si38-logs-cloudtrail" # forces replacement
      ~ bucket_domain_name          = "scaffoldly-si38-logs.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "scaffoldly-si38-logs.s3.amazonaws.com" -> (known after apply)
        force_destroy               = false
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "scaffoldly-si38-logs" -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      ~ lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
            enabled                                = true
          ~ id                                     = "tf-s3-lifecycle-20200819164501957400000008" -> (known after apply)
          - tags                                   = {} -> null

            noncurrent_version_transition {
                days          = 180
                storage_class = "DEEP_ARCHIVE"
            }
            noncurrent_version_transition {
                days          = 30
                storage_class = "STANDARD_IA"
            }
            noncurrent_version_transition {
                days          = 60
                storage_class = "GLACIER"
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = true
            mfa_delete = false
        }
    }

  # module.aws_logging.aws_s3_bucket_policy.bucket_policy must be replaced
-/+ resource "aws_s3_bucket_policy" "bucket_policy" {
      ~ bucket = "scaffoldly-si38-logs" -> (known after apply) # forces replacement
      ~ id     = "scaffoldly-si38-logs" -> (known after apply)
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                        Action    = "s3:PutObject"
                        Condition = {
                            StringEquals = {
                                s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                        Effect    = "Allow"
                      ~ Principal = {
                          ~ Service = [
                              - "delivery.logs.amazonaws.com",
                              - "cloudtrail.amazonaws.com",
                            ] -> "cloudtrail.amazonaws.com"
                        }
                      ~ Resource  = "arn:aws:s3:::scaffoldly-si38-logs/AWSLogs/656889719924/*" -> "arn:aws:s3:::scaffoldly-si38-logs-cloudtrail/AWSLogs/656889719924/*"
                        Sid       = ""
                    },
                  ~ {
                        Action    = "s3:GetBucketAcl"
                        Effect    = "Allow"
                      ~ Principal = {
                          ~ Service = [
                              - "delivery.logs.amazonaws.com",
                              - "cloudtrail.amazonaws.com",
                            ] -> "cloudtrail.amazonaws.com"
                        }
                      ~ Resource  = "arn:aws:s3:::scaffoldly-si38-logs" -> "arn:aws:s3:::scaffoldly-si38-logs-cloudtrail"
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # module.dns.module.dns[0].aws_route53_record.apex_wildcard["scaffoldly.dev"] will be destroyed
  - resource "aws_route53_record" "apex_wildcard" {
      - fqdn    = "_5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev" -> null
      - id      = "Z09011832P733251NUAHX__5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev._CNAME" -> null
      - name    = "_5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev" -> null
      - records = [
          - "_2e16e8130ae11d1d1563bf977d42da86.zdxcnfdgtt.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z09011832P733251NUAHX" -> null
    }

  # module.dns.module.dns[1].aws_route53_record.apex_wildcard["scaffold.ly"] will be destroyed
  - resource "aws_route53_record" "apex_wildcard" {
      - fqdn    = "_7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly" -> null
      - id      = "Z08393103BT7N9U33F6L7__7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly._CNAME" -> null
      - name    = "_7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly" -> null
      - records = [
          - "_8d0cd48ec113e127fa88fb6ef9796a5e.zdxcnfdgtt.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z08393103BT7N9U33F6L7" -> null
    }

Plan: 3 to add, 0 to change, 4 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```